### New Dataframe

In [5]:
import numpy as np 
import pandas as pd

In [6]:
df1 = pd.DataFrame({
    "Event": ["Start", "Check", "Finish", "Review"],
    "Date": [pd.Timestamp("2025-08-01"),
             pd.NaT,  # Missing datetime
             pd.Timestamp("2025-08-05"),
             pd.NaT]   # Missing datetime
})
df1

    Event       Date
0   Start 2025-08-01
1   Check        NaT
2  Finish 2025-08-05
3  Review        NaT

In [7]:
# removing NaT values
df1.dropna()

    Event       Date
0   Start 2025-08-01
2  Finish 2025-08-05

In [8]:
df2 = pd.DataFrame({
    "Event": ["Start", "Check", "Finish", "Review"],
    "Date": [pd.NaT,
             pd.NaT,  
             pd.NaT,
             pd.NaT]
})
df2

    Event Date
0   Start  NaT
1   Check  NaT
2  Finish  NaT
3  Review  NaT

In [10]:
df2.dropna(how='all' , axis=1)  # Remove columns where all elements are NaT

    Event
0   Start
1   Check
2  Finish
3  Review

In [15]:
df3 = pd.DataFrame({
    "Name": ["Karan", "Diya", "Yash", "Anjali" , "Karan"],
    "Toy": ["Car" , "Doll" , np.nan , "Puzzle" , np.nan],
    "Born": [pd.NaT,
             pd.Timestamp("2011-02-02"),
             pd.NaT,
             pd.Timestamp("2013-04-04"),
             pd.NaT]
})
df3

     Name     Toy       Born
0   Karan     Car        NaT
1    Diya    Doll 2011-02-02
2    Yash     NaN        NaT
3  Anjali  Puzzle 2013-04-04
4   Karan     NaN        NaT

In [17]:
# drop duplicates 
df3.drop_duplicates(subset=['Name'], keep=False)  # Remove duplicates based on 'Name' column

     Name     Toy       Born
1    Diya    Doll 2011-02-02
2    Yash     NaN        NaT
3  Anjali  Puzzle 2013-04-04

In [ ]:
# shape of dataframe
df3.shape

(5, 3)

In [ ]:
# information of dataframe 
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Toy     3 non-null      object
 2   Born    2 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 252.0+ bytes

In [ ]:
# Check for null values in the dataframe
df3.notnull()

   Name    Toy   Born
0  True   True  False
1  True   True   True
2  True  False  False
3  True   True   True
4  True  False  False

In [22]:
# Check for null values in the dataframe
df3.isnull()

    Name    Toy   Born
0  False  False   True
1  False  False  False
2  False   True   True
3  False  False  False
4  False   True   True